Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_PlaygroundBookFormatRef/PlaygroundBookFormatReference-level2.tmx
Source language: en_us
Languages: ja

source: Line 2 checks if the message argument is a dictionary and line 3 gets the command name.
ja: 行２は、message引数がディクショナリかどうか調べます、そして行３はコマンド名を取得します。

source: Line 3 creates an array with two playground value cases, a string and an integer.
ja: 行３は、文字列と整数、２つのプレイグラウンド値ケース節を持つ配列を作成します。

source: Line 3 hides the turnLeft() function; line 4 adds the turnRight() function to the list of possible completions; and Line 5 adds the Swift for statement.
ja: 行３は、turnLeft()関数を隠します；行４はturnRight()関数を可能な補完のリストに加えます；そして行５はSwiftのfor文を加えます。

source: Line 4 constructs a playground value case of an array, and sets the associated value of that case to theArray.
ja: 行４は、ある配列のプレイグラウンド値ケース節を構築します、そしてそのケース節の関連値をtheArrayに設定します。

source: Line 4 defines the MyLiveView class that conforms to the PlaygroundLiveViewSafeAreaContainer protocol.
ja: 行４は、MyLiveViewクラスを定義します、それはPlaygroundLiveViewSafeAreaContainerプロトコルに準拠します。

source: Line 5 constructs a playground value case of a dictionary, and sets the associated value for the case to theDict.
ja: 行５は、あるディクショナリのプレイグラウンド値ケース節を構築します、そしてケース節の関連値をtheDictに設定します。

source: Line 6 calls a custom function to update the user assessment, and line 7 terminates the current playground.
ja: 行６は、カスタム関数を呼び出してユーザ評価を更新します、そして行７は現在のプレイグラウンドを終了します。

source: Line 9 creates innerView, an instance of a custom view class.
ja: 行９は、innerView、カスタムビュークラスのインスタンスを作成します。

source: Lines 15-20 constrain the the edges of innerView to the bounds of the safe area.
ja: 行15-20は、innerViewの端を安全領域の境界へ制約します。

source: Lines 2-9 implement the method for receiving the message from the always-on live view.
ja: 行２-９は、常時接続のライブビューからメッセージを受け取るためのメソッドを実装します。

source: Lines 3 and 4 create a dictionary with two entries, a playground value case of a string for the "animal" key and a playground value case of an integer for the "count" key.
ja: 行３と４は、２つの登録項目、"animal"キーに対するある文字列のプレイグラウンド値ケース節と"count"キーに対するある整数のプレイグラウンド値ケース節を持つディクショナリを作成します。

source: Lines 3-8 declare MyClassThatListens, a class that receives messages by conforming to the PlaygroundRemoteLiveViewProxyDelegate Protocol.
ja: 行３-８はMyClassThatListens、PlaygroundRemoteLiveViewProxyDelegateプロトコルに準拠することによってメッセージを受け取るクラスを宣言します。

source: Lines 4 and 5 checks if “finishedTask” is true.
ja: 行４と５は、「finishedTask」がtrueかどうか確認します。

source: Lines 6 and 7 create liveView, an instance of MyLiveView, and set the background color to dark gray.
ja: 行６と７は、liveView、MyLiveViewのインスタンスを作成します、そして背景色を暗い灰色に設定します。

source: Linking to Terms
ja: 用語へリンクする

source: List of identifiers, including function names, punctuation, variables, and any other symbol
ja: 関数名、句読点、変数、そして何らかの他のシンボルを含んでいる、いくらかの識別子からなるリスト

source: List of keywords
ja: 単語のリスト

source: List of literals
ja: リテラルのリスト

source: List of modules
ja: モジュールのリスト

source: List of snippet names
ja: スニペット名のリスト

source: List of string literals to match against symbol completions based on the name displayed in the shortcut bar.
ja: ショートカットバーにおいて表示される名前に基づき、いくらかのシンボル補完と一致する、いくらかの文字列リテラルからなるリスト。

source: Listing 16-1 shows an example Hints property list.
ja: コード出力 16-1 は、例のHintsプロパティリストを示します。

source: Live view configuration
ja: ライブビュー設定

source: Live views opened from LiveView.swift start running when the playground is opened and do not require the playground to be executing.
ja: LiveView.swiftから開かれたライブビューは、プレイグラウンドが開かれる時に動作を始め、実行されるのにプレイグラウンドを必要としません。

source: LiveViewEdgeToEdge Key
ja: LiveViewEdgeToEdgeキー

source: LiveViewMode Key
ja: LiveViewModeキー

source: Load textures from many sources, render graphics in a standard Metal view, and work efficiently with models provided by ModelIO.
ja: 多くのソースからテクスチャをロードして、グラフィックを標準的なMetalビューにおいて描画し、そしてModelIOによって提供されるモデルを使ってより効率的に働きます。

source: Localized Comment Markers
ja: ローカライズされたコメントマーカー

source: Localized Resources Folders
ja: ローカライズリソースフォルダ

source: Localized resources are stored in folders named with a locale identifier and the .lproj folder name extension.
ja: ローカライズリソースフォルダは、ロケール識別子と.lprojフォルダ名拡張子で名前を付けられるフォルダに格納されます。

source: Localizing a Feed
ja: フィードの現地語化

source: Make large-scale mathematical computations and image calculations, optimized for high performance.
ja: 高性能を発揮できるようにされた、大規模な数学計算と画像計算を作成します、

source: Make sure you’re aware of and in agreement with these rules before making your feed available publicly.
ja: それらの規則を承知して合意することを、あなたのフィードを公然と利用可能にする前に確認してください。

source: Make targeted changes to the book’s content and structure in Xcode
ja: 目的とする変更をブックの内容と構造に対してXcodeにおいて行う

source: Manage color and access image metadata.
ja: 色を管理し、画像メタデータにアクセスします。

source: Manifest Files
ja: マニフェストファイル

source: Manifest files for a book, and for each chapter and page, contain configuration information such as the order of chapters or the name of a page.
ja: あるブックのマニフェストファイル、そして各章およびページは、章の順序やページの名前といった構成情報を含みます。

source: Manually Adding a Subscription
ja: 手動でサブスクリプションを追加する

source: Manually-entered URLs must not include the Swift Playgrounds subscriptions universal link prefix.
ja: 手動で入力されたURLは、Swift Playgroundsサブスクリプションユニバーサルリンク接頭辞を含んではいけません。

source: Message sending between an always-on live view and the playground page requires a proxy.
ja: 常時接続のライブビューとプレイグラウンドページとの間でメッセージを送るには、プロキシを必要とします。

source: Messages from the always-on live view will now be sent to myListener.
ja: 常時接続ライブビューからのメッセージは、現在myListenerに送られます。

source: Metadata such as book version and book target platform
ja: ブックバージョンおよびブック対象プラットホームなどのメタデータ

source: MinimumSwiftPlaygroundsVersion Key
ja: MinimumSwiftPlaygroundsVersionキー

source: Multiline Editable Areas
ja: 複数行編集エリア

source: Multiline editable code areas allow users to enter one or more lines of free-form text.
ja: 複数行編集コードエリアは、ユーザに１行以上の自由な形式のテキストを入力可能にします。

source: Name Key
ja: Nameキー

source: Namespace
ja: 名前空間

source: NavigateCommandButtonTitle Key
ja: NavigateCommandButtonTitleキー

source: New document that describes the formats used for creating books for Swift Playgrounds
ja: Swift Playgrounds用のブックの作成に使われる形式を解説する新しい文書。

source: None
ja: 何もなし

source: Not all JSON documents are feeds.
ja: 全てのJSON文書がフィードであるわけではありません。

source: NotReadyToCopyInstructions Key
ja: NotReadyToCopyInstructionsキー

source: Note any additional changes that are needed, and return to step 1
ja: 必要とされる追加の変更を書き留めて、手順１に戻る

source: Note that some specialty libraries at the Core OS and Core Services level are not packaged as frameworks.
ja: Core OSおよびCore Servicesでのいくつかの特殊ライブラリはフレームワークとしてパッケージされないことに注意してください。

source: Often an institution or company name.
ja: たいていは団体または会社名。

source: On the destination page, specify where the code should be copied by placing it between the copy-destination and end-copy-destination delimiters.
ja: 行き先ページにおいて、コードがコピーされるべき場所をそれをcopy-destinationとend-copy-destination区切り記号の間に置くことによって指定してください。

source: On the source page, define the code to be copied by placing it between the copy-source and end-copy-source delimiters.
ja: ソースページにおいて、コピーされることになるコードをcopy-sourceとend-copy-source区切り記号の間にそれを置くことによって定義してください。

source: One or more peripherals have been discovered and can be selected.
ja: ひとつ以上の周辺機器が見つかり、選択可能です。

source: One type of placeholder is an argument to the editable area delimiter and is discussed below.
ja: プレースホルダーの一方の種類は、編集エリア区切り記号に対して１つの引数があるもので、下で議論されます。

source: Open a popover with the definition of a single term from a link on a playground page
ja: プレイグラウンドページ上のリンクから単一用語の定義を持つポップオーバーを開く

source: Open the full glossary from the Tools menu
ja: Toolsメニューから完全なグロッサリーを開く

source: Open the updated book and test the changes
ja: 更新されたブックを開いて変更をテストする

source: Optimize font handling with automatic font substitution, and get easy access to font metrics and glyph data.
ja: 自動フォント置換を使ってフォント処理を最適化します、そしてフォントメトリクスとグリフデータに対する簡単なアクセスを与えます。

source: Optimize graphics and compute performance with kernels that are fine-tuned for the unique characteristics of each Metal GPU family.
ja: グラフィクスと計算性能をカーネルを使って最適化します、それは各Metal GPUファミリーの独特な特徴に対して微調整されます。

source: Order of chapters
ja: 章の順序

source: Order of pages
ja: ページ順序

source: Overview
ja: 概要

source: Page
ja: ページ

source: PageReference Key
ja: PageReferenceキー

source: Pages Key
ja: Pagesキー

source: Parameters
ja: パラメータ

source: Placeholder Tokens
ja: プレースホルダートークン

source: Placeholders
ja: プレースホルダー

source: Play custom movie files, such as cut scenes in games.
ja: カスタムムービーファイル、例えばゲームの中のカットシーンなどを再生します。

source: Playground Book Frameworks
ja: プレイグラウンドブックフレームワーク

source: Playground Book Package
ja: Playgroundブックパッケージ

source: Playground Page Annotations
ja: Playgroundページ注釈

source: Playground Page Manifest
ja: プレイグラウンドページマニフェスト

source: Playground logging configuration
ja: プレイグラウンドログ設定

source: Playground logging is off and no results are displayed.
ja: プレイグラウンドログはオフです、そして結果は表示されません。

source: PlaygroundBluetooth Framework
ja: PlaygroundBluetoothフレームワーク

source: PlaygroundKeyValueStore Class
ja: PlaygroundKeyValueStoreクラス

source: PlaygroundLiveViewMessageHandler Protocol
ja: PlaygroundLiveViewMessageHandlerプロトコル

source: PlaygroundLiveViewRepresentation Enumeration
ja: PlaygroundLiveViewRepresentation列挙

source: PlaygroundLiveViewSafeAreaContainer Protocol
ja: PlaygroundLiveViewSafeAreaContainerプロトコル

source: PlaygroundLiveViewable Protocol
ja: PlaygroundLiveViewableプロトコル

source: PlaygroundLoggingMode Key
ja: PlaygroundLoggingModeキー

source: PlaygroundPage Class
ja: PlaygroundPageクラス

source: PlaygroundRemoteLiveViewProxy Class
ja: PlaygroundRemoteLiveViewProxyクラス

source: PlaygroundRemoteLiveViewProxyDelegate Protocol
ja: PlaygroundRemoteLiveViewProxyDelegateプロトコル

source: PlaygroundSupport Module
ja: PlaygroundSupportモジュール

source: PlaygroundValue Enumeration
ja: PlaygroundValue列挙

source: Popular sites such as GitHub via GitHub Pages, Squarespace, and others offer the required features for hosting subscriptions.
ja: 一般的なサイト、例えばGitHub PagesによるGitHub、Squarespace、およびその他は、ホストするサブスクリプションに必要とされる機能を提供します。

source: PosterReference Key
ja: PosterReferenceキー

source: Prefixes
ja: 接頭辞

source: Preview images should be 800px × 600px.
ja: プレビュー画像は、800px × 600pxでなければなりません。

source: Process digital video—including manipulation of individual frames—using a pipeline-based API and support for both Metal and OpenGL.
ja: デジタルビデオを、パイプラインに基づくAPIおよびMetalとOpenGL両方に対するサポートを使って — 個々のフレームの操作を含めて — 処理します。

source: Protect information and control access to your playground book.
ja: 情報を保護して、あなたのプレイグラウンドブックに対するアクセスを制御します。

source: Protocol Methods
ja: プロトコルメソッド

source: Provide high-level scene descriptions, optimized animations and actions, physics simulation, particle effects, and physically based rendering.
ja: 高水準シーン記述、最適化されたアニメーションとアクション、物理シミュレーション、パーティクルエフェクト、そして物理ベースレンダリングを提供します。

source: Public and Private Resources Folders
ja: パブリックおよびプライベートリソースフォルダ

source: Publishing Subscriptions
ja: サブスクリプションの出版

source: Read and write most image file formats.
ja: ほとんどの画像ファイル形式を読み書きします。

source: Read-Only Page Content
ja: 読み出し専用ページコンテンツ

source: ReadyToCopyInstructions Key
ja: ReadyToCopyInstructionsキー

source: Receive and handle accelerometer events and other motion events.
ja: 加速度計イベントや他のモーションイベントを受け取って取り扱います。

source: Record audio and video directly from your playground book that users can share through email, text messages, and social websites.
ja: オーディオおよびビデオをあなたのプレイグラウンドブックから直接に記録します、それはユーザがemail、テキストメッセージ、そしてソーシャルウェブサイトで共有できます。

source: Record or play audio, convert formats, parse audio streams, and configure your audio session.
ja: オーディオの録音や再生、フォーマットの変換、オーディオストリームの解析、そしてあなたのオーディオセッションの構成をします。

source: Record, edit, and play audio and video; configure your audio session; and respond to changes in the device audio environment.
ja: オーディオとビデオの録音、編集、そして再生します；あなたのオーディオセッションを構成します；そしてデバイスオーディオ環境における変更に応答します。

source: Render advanced 3D graphics and perform data-parallel computations.
ja: 先進的な3Dグラフィクスを描画して、データ並列計算を実行します。

source: Represent time-based audio-visual assets with essential data types.
ja: 時間に基づくオーディンビジュアル資産（アセット）を本質的データ型で表します。

source: Required
ja: 必須

source: Required when the playground book is hosted on a different domain than the feed.
ja: プレイグラウンドブックがフィードと異なるドメインでホストされる場合に必要です。

source: Resources, such as images, sounds, and text files, are stored in specially named folders with no folder name extensions.
ja: リソース、例えば画像、サウンド、そしてテキストファイルなどは、名前拡張子を持たないいくらかの特有名前フォルダに格納されます。

source: Return Value
ja: 戻り値

source: Return value
ja: 戻り値

source: Revision History
ja: 改訂履歴

source: Secure the data your playground book manages.
ja: あなたのプレイグラウンドブックが管理するデータを守ります。

source: See ARKit Framework Reference.
ja: ARKit Framework Referenceを見てください。

source: See PDFKit Framework Reference.
ja: PDFKit Framework Referenceを見てください。

source: See Vision Framework Reference.
ja: Vision Framework Referenceを見てください。

source: See SpriteKit Programming Guide and SpriteKit Framework Reference.
ja: SpriteKit Programming GuideとSpriteKit Framework Referenceを見てください。

source: See AVFoundation Programming Guide and AV Foundation Framework Reference.
ja: AVFoundation Programming GuideおよびAV Foundation Framework Referenceを見てください。

source: See AVKit Framework Reference.
ja: AVKit Framework Referenceを見てください。

source: See Accelerate Framework Reference.
ja: Accelerate Framework Referenceを見てください。

source: See Accounts Framework Reference.
ja: Accounts Frameworkリファレンスを見てください。

source: See Audio Toolbox Framework Reference.
ja: Audio Toolbox Frameworkリファレンスを見てください。

source: See Audio Unit Programming Guide and Audio Unit Framework Reference.
ja: Audio Unit Programming GuideおよびAudio Unit Framework Referenceを見てください。

source: See CFNetwork Programming Guide and CFNetwork Reference Collection.
ja: CFNetwork Programming GuideおよびCFNetwork Reference Collectionを見てください。

source: See Core Audio Overview and Core Audio Framework Reference.
ja: Core Audio OverviewおよびCore Audio Framework Referenceを見てください。

source: See Core Bluetooth Programming Guide and Core Bluetooth Framework Reference.
ja: Core Bluetooth Programming GuideおよびCore Bluetooth Framework Referenceを見てください。

source: See Core Data Programming Guide and Core Data Framework Reference.
ja: Core Data Programming GuideおよびCore Data Framework Referenceを見てください。

source: See Core Foundation Design Concepts and Core Foundation Framework Reference.
ja: Core Foundation Design ConceptsおよびCore Foundation Framework Referenceを見てください。

source: See Core Graphics Reference Collection.
ja: Core Graphics Reference Collectionを見てください。

source: See Core Image Programming Guide and Core Image Reference Collection.
ja: Core Image Programming GuideおよびCore Image Reference Collectionを見てください。

source: See Core Location Framework Reference.
ja: Core Location Framework Referenceを見てください。

source: See Core MIDI Framework Reference.
ja: Core MIDI Framework Referenceを見てください。

source: See Core Media Framework Reference.
ja: Core Media Framework Referenceを見てください。

source: See Core Motion Framework Reference.
ja: Core Motion Framework Referenceを見てください。

source: See Core Text Programming Guide and Core Text Reference Collection.
ja: Core Text Programming GuideおよびCore Text Reference Collectionを見てください。

source: See Core Video Programming Guide and Core Video Reference Collection.
ja: Core Video Programming GuideおよびCore Video Reference Collectionを見てください。

source: See CoreAudioKit Framework Reference.
ja: CoreAudioKit Framework Referenceを見てください。

source: See External Accessory Programming Topics and External Accessory Framework Reference.
ja: External Accessory Programming TopicsおよびExternal Accessory Framework Referenceを見てください。

source: See Foundation Framework Reference.
ja: Foundation Framework Referenceを見てください。

source: See GLKit Framework Reference.
ja: GLKit Framework Referenceを見てください。

source: See Game Center Programming Guide and Game Kit Framework Reference.
ja: Game Center Programming GuideおよびGame Kit Framework Referenceを見てください。

source: See Game Controller Programming Guide and Game Controller Framework Reference.
ja: Game Controller Programming GuideおよびGame Controller Framework Referenceを見てください。

source: See GameplayKit Programming Guide and GameplayKit Framework Reference.
ja: GameplayKit Programming GuideおよびGameplayKit Framework Referenceを見てください。

source: See IOSurface Framework Reference.
ja: IOSurface Framework Referenceを見てください。

source: See Image I/O Programming Guide and Image I/O Reference Collection.
ja: Image I/O Programming GuideおよびImage I/O Reference Collectionを見てください。

source: See MapKit Framework Reference.
ja: MapKit Framework Referenceを見てください。

source: See Media Accessibility Framework Reference.
ja: Media Accessibility Framework Referenceを見てください。

source: See Media Player Framework Reference.
ja: Media Player Framework Referenceを見てください。

source: See Message UI Framework Reference.
ja: Message UI Framework Referenceを見てください。

source: See Metal Performance Shaders Framework Reference.
ja: Metal Performance Shaders Framework Referenceを見てください。

source: See Metal Programming Guide and Metal Framework Reference.
ja: Metal Programming GuideおよびMetal Framework Referenceを見てください。

source: See MetalKit Framework Reference and MetalKit Functions Reference.
ja: MetalKit Framework ReferenceとMetalKit Functions Referenceを見てください。

source: See Mobile Core Services Framework Reference.
ja: Mobile Core Services Framework Referenceを見てください。

source: See ModelIO Framework Reference.
ja: ModelIO Framework Referenceを見てください。

source: See Multipeer Connectivity Framework Reference.
ja: Multipeer Connectivity Framework Referenceを見てください。

source: See OpenGL ES Programming Guide and OpenGL ES Framework Reference.
ja: OpenGL ES Programming GuideとOpenGL ES Framework Referenceを見てください。

source: See Photos Framework Reference.
ja: Photos Framework Referenceを見てください。

source: See PhotosUI Framework Reference.
ja: PhotosUI Framework Referenceを見てください。

source: See Quartz 2D Programming Guide and Quartz Core Framework Reference.
ja: Quartz 2D Programming GuideおよびQuartz Core Framework Referenceを見てください。

source: See Quick Look Programming Guide and Quick Look Framework Reference for iOS.
ja: Quick Look Programming GuideおよびQuick Look Framework Reference for iOSを見てください。

source: See ReplayKit Framework Reference.
ja: ReplayKit Framework Referenceを見てください。

source: See Safari Services Framework Reference.
ja: Safari Services Framework Referenceを見てください。

source: See Security Overview and Security Framework Reference.
ja: Security OverviewおよびSecurity Framework Referenceを見てください。

source: See Social Framework Reference.
ja: Social Framework Referenceを見てください。

source: See View Controller Programming Guide for iOS and UIKit Framework Reference.
ja: View Controller Programming Guide for iOSおよびUIKit Framework Referenceを見てください。

source: See WebKit Framework Reference.
ja: WebKit Framework Referenceを見てください。

source: See AssessmentStatus Enumeration.
ja: AssessmentStatus Enumerationを参照。

source: See Chapters Key.
ja: Chaptersキーを見てください。

source: See CodeCopySetup Key.
ja: CodeCopySetup Keyを見てください。

source: See Content Key.
ja: Contentキーを見てください。

source: See ContentIdentifier Key.
ja: ContentIdentifierキーを見てください。

source: See ContentVersion Key.
ja: ContentVersionキーを見てください。

source: See CopyCommandButtonTitle Key.
ja: CopyCommandButtonTitleキーを見てください。

source: See CutsceneReference Key.
ja: CutsceneReferenceキーを見てください。

source: See DefaultCommandButtonTitle Key.
ja: DefaultCommandButtonTitleキーを見てください。

source: See Definition Key.
ja: Definitionキーを見てください。

source: See DeploymentTarget Key.
ja: DeploymentTargetキーを見てください。

source: See DevelopmentRegion Key.
ja: DevelopmentRegion Keyを見てください。

source: See FirstUse Key.
ja: FirstUseキーを見てください。

source: See ImageReference Key.
ja: ImageReferenceキーを見てください。

source: See LiveViewEdgeToEdge Key.
ja: LiveViewEdgeToEdgeキーを見てください。

source: See LiveViewMode Key.
ja: LiveViewModeキーを見てください。

source: See MinimumSwiftPlaygroundsVersion Key.
ja: MinimumSwiftPlaygroundsVersion Keyを見てください。

source: See Name Key.
ja: Nameキーを見てください。

source: See NavigateCommandButtonTitle Key.
ja: NavigateCommandButtonTitleキーを見てください。

source: See NotReadyToCopyInstructions Key.
ja: NotReadyToCopyInstructionsキーを見てください。

source: See PageReference Key.
ja: PageReferenceキーを見てください。

source: See Pages Key.
ja: Pagesキーを見てください。

source: See PlaygroundKeyValueStore Class.
ja: PlaygroundKeyValueStore Classを参照。

source: See PlaygroundLiveViewMessageHandler Protocol.
ja: PlaygroundLiveViewMessageHandler Protocolを参照。

source: See PlaygroundLiveViewRepresentation Enumeration.
ja: PlaygroundLiveViewRepresentation Enumerationを見てください。

source: See PlaygroundLiveViewable Protocol.
ja: PlaygroundLiveViewable Protocolを参照。

source: See PlaygroundLoggingMode Key.
ja: PlaygroundLoggingModeキーを見てください。

source: See PlaygroundPage Class.
ja: PlaygroundPage Classを参照。

source: See PlaygroundRemoteLiveViewProxy Class.
ja: PlaygroundRemoteLiveViewProxy Classを参照。

source: See PlaygroundRemoteLiveViewProxyDelegate Protocol.
ja: PlaygroundRemoteLiveViewProxyDelegate Protocolを参照。

source: See PlaygroundValue Enumeration.
ja: PlaygroundValue Enumerationを参照。

source: See PosterReference Key.
ja: PosterReferenceキーを見てください。

source: See ReadyToCopyInstructions Key.
ja: ReadyToCopyInstructionsキーを見てください。

source: See SpoilerButtonTitle Key.
ja: SpoilerButtonTitleキーを見てください。

source: See SwiftVersion Key.
ja: SwiftVersionキーを見てください。

source: See Term Name Key.
ja: 用語名キーを見てください。

source: See Terms Key.
ja: Termsキーを見てください。

source: See Title Key.
ja: Titleキーを見てください。

source: See Version Key.
ja: Versionキーを見てください。

source: See FileReference Key.
ja: FileReferenceキーを見てください。

source: See PlaygroundLiveViewSafeAreaContainer Protocol.
ja: PlaygroundLiveViewSafeAreaContainer Protocolを参照。

source: Selecting a placeholder on the playground page shows the shortcut bar.
ja: プレイグラウンド上でプレースホルダーを選択すると、ショートカットバーが現れます。

source: Selecting a placeholder with a defined type shows a type-specific popover, if one exists.
ja: 定義された型を持つプレースホルダーを選択すると、型特有のポップオーバーが現れます、それが存在するならば。

source: Send and receive messages between playgrounds and live views
ja: プレイグラウンドとライブビューの間でのメッセージの送信と受信

source: Set needsIndefiniteExecution to true to continue execution after top-level code stops executing.
ja: needsIndefiniteExecutionをtrueに設定することで、トップレベルコードが実行を停止する後で実行を継続してください。

source: Set and get the learning progress of the user, update hints, and show success text
ja: ユーザの学習の進捗の設定および取得、ヒントの更新、そして結果テキストの表示

source: Set it to false before the end of the top-level code is reached to stop execution after top-level code stops.
ja: それをトップレベルコードの終わりに届く前にfalseに設定することで、トップレベルコードが停止する後に実行を停止してください。

source: Set the assessment status to display success text or update the hints for the page.
ja: 結果成功テキストを表示またはページに対するヒントを更新するために、評価状態を設定します。

source: Set this property to true to start scanning for peripherals.
ja: このプロパティをtrueに設定することによって、周辺機器の走査が始まります。

source: Sets all of the information about the specified peripheral at once.
ja: 指定された周辺機器について全ての情報を一度に設定します。

source: Sets the live view to extend past the margin in the area used for live views.
ja: そのライブビューを設定して、幾つかのライブビューのために使われるエリアにおける限界を超えて拡張するようにします。

source: Sets the live view to show even when it is not running.
ja: ライブビューを設定して、それが動作していない時でさえ表示するようにします。

source: Setting liveView to nil does not dismiss an always-on live view.
ja: liveViewをnilに設定することは、常時接続のライブビューを退去させません。

source: Setting it to false while the playground is executing continuously has no effect.
ja: それをプレイグラウンドが実行している間にfalseに設定することは、効果を持ちません。

source: Setting the key to true expands the live view to fill the live view area, which includes the Run button and the Hints button.
ja: キーをtrueに設定することで、ライブビューをライブビューエリアいっぱいに展開します、それはRunボタンとHintsボタンを含みます。

source: Share and access persistent data
ja: 永続データの共有とアクセス

source: Share hardware-accelerated buffer data (framebuffers and textures) across multiple processes.
ja: ハードウェア増速されたバッファデータ（フレームバッファとテクスチャ）を複数プロセスをまたいで共有します。

source: Shared Code Folders
ja: 共有コードフォルダ

source: Shared code is stored in folders named Sources.
ja: 共有コードは、Sourcesと名前のつけられるフォルダに格納されます。
